module.exports = {
  /**
   * 手机号码
   */
  isMobile: /^1(3\d|4[5-9]|5[0-35-9]|6[2567]|7[0-8]|8\d|9[0-35-9])\d{8}$/,
  /**
   * 电话号码
   */
  isLandline: /^(0\d{2,3}-?|\(0\d{2,3}\))?[1-9]\d{4,7}(-\d{1,8})?$/,
  /**
   * 手机号或电话号
   * 规则说明
   * 可以是11位的合格手机号
   * 可以是“区号-电话号-分机号”或者是“(区号)电话号-分机号”格式
   * 区号是0开头的3～4位数字，可以没有区号
   * 电话号是5～8位数字，不能以0开头
   * 分机号是1～8位数字，可以没有分机号
   * @example
   * ①13812341234
   * ②010-12345678
   * ③(0432)1234567-1234
   * ④12345678
   */
  isPhoneOrMobile: /^1(3\d|4[5-9]|5[0-35-9]|6[2567]|7[0-8]|8\d|9[0-35-9])\d{8}$|^(0\d{2,3}-?|\(0\d{2,3}\))?[1-9]\d{4,7}(-\d{1,8})?$/,
  /**
   * 不能输入汉字
   */
  noChineseCharacters: /[\u4E00-\u9FA5]/g,
  /**
   * 判断是否为整数
   */
  validateInteger: /^-?\d+$/,
  /**
   * 只能输入数字和+-
   */
  validateNumber: /^[0-9]*[+,-]?\d*$/,
  /**
   * 判断是否为非负整数 （正整数 + 0）
   */
  validateNonNegativeInteger: /^\d+$/,
  /**
    *  判断是否为非负数 （正数 + 0）且保留小数点后两位
    */
  validateNonNegativeNumber: /^(0\.?\d{0,2}|[1-9]\d*\.?\d{0,2})$/,
  /**
   * 判断是否为正数且保留小数点后两位
   */
  validatePositiveDecimalTwo: /^(([0-9]+)|([0-9]+\.[0-9]{0,2}))$/,
  /**
   * 判断是否为正数且保留小数点后一位
   */
  validatePositiveDecimalOne: /^\d*\.?\d?$/
}
